layer {
    name: "images"
    type: "MemoryData"
    top: "data"
    top: "label"
    memory_data_param {
        height: 28
        width: 28
        channels: 1
        batch_size: 600
    }
}
layer {
    name: "fc1"
    type: "InnerProduct"
    bottom: "data"
    top: "fc1"
    inner_product_param {
        num_output: 10
    }
}
layer {
    name: "out"
    type: "SoftmaxWithLoss"
    bottom: "fc1"
    bottom: "label"
    top: "out"
}